Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: The syntax:
it_it: La sintassi:

source: The template argument T... can be any number of types, for example:
it_it: L'argomento template T... può essere di qualsiasi tipo, ad esempio:

source: The template argument `T...` can be any number of types, for example:
it_it: L'argomento template `T...` può essere di qualsiasi tipo, ad esempio:

source: The template parameter `T` is any mock class, except for another `NiceMock`, `NaggyMock`, or `StrictMock`.
it_it: Il parametro template `T` è qualsiasi classe mock, ad eccezione di un altra `NiceMock`, `NaggyMock` o `StrictMock`.

source: The term *Test* is commonly of broad enough sense, including ISTQB's definition of *Test Case*, so it's not much of a problem here.
it_it: Il termine *Test* ha comunemente un senso sufficientemente ampio, inclusa la definizione di *Test Case*, di ISTQB, quindi non è un grosso problema.

source: The term Test is commonly of broad enough sense, including ISTQB's definition of Test Case, so it's not much of a problem here.
it_it: Il termine Test ha comunemente un senso sufficientemente ampio, inclusa la definizione di Test Case, di ISTQB, quindi non è un grosso problema.

source: The test function body may contain other assertions and statements as well, if necessary.
it_it: Se necessario, il corpo della funzione di test può contenere anche altre asserzioni e dichiarazioni.

source: The test name suffix can only contain alphanumeric characters and underscores.
it_it: Il suffisso del nome del test può contenere solo caratteri alfanumerici e underscore.

source: The test suite must be registered with REGISTER_TYPED_TEST_SUITE_P.
it_it: La test suite deve essere registrata con REGISTER_TYPED_TEST_SUITE_P.

source: The test suite and tests must be defined with TYPED_TEST_SUITE_P and TYPED_TEST_P.
it_it: La test suite e i test devono essere definiti con TYPED_TEST_SUITE_P e TYPED_TEST_P.

source: The test suite and tests must be defined with [`TYPED_TEST_SUITE_P`](#TYPED_TEST_SUITE_P) and [`TYPED_TEST_P`](#TYPED_TEST_P).
it_it: La test suite e i test devono essere definiti con [`TYPED_TEST_SUITE_P`](#TYPED_TEST_SUITE_P) and [`TYPED_TEST_P`](#TYPED_TEST_P).

source: The test suite must be defined with TYPED_TEST_SUITE_P.
it_it: La test suite dev'essere definita con TYPED_TEST_SUITE_P.

source: The test suite must be defined with TYPED_TEST_SUITE.
it_it: La test suite dev'essere definita con TYPED_TEST_SUITE.

source: The test suite must be defined with [`TYPED_TEST_SUITE_P`](#TYPED_TEST_SUITE_P).
it_it: La test suite dev'essere definita con [`TYPED_TEST_SUITE_P`](#TYPED_TEST_SUITE_P).

source: The test suite must be defined with [`TYPED_TEST_SUITE`](#TYPED_TEST_SUITE).
it_it: La test suite dev'essere definita con [`TYPED_TEST_SUITE`](#TYPED_TEST_SUITE).

source: The test suite must be registered with [`REGISTER_TYPED_TEST_SUITE_P`](#REGISTER_TYPED_TEST_SUITE_P).
it_it: La test suite deve essere registrata con [`REGISTER_TYPED_TEST_SUITE_P`](#REGISTER_TYPED_TEST_SUITE_P).

source: The test suite name is *`TestFixtureName`*.
it_it: Il nome della test suite è *`TestFixtureName`*.

source: The test's result is determined by the assertions; if any assertion in the test fails (either fatally or non-fatally), or if the test crashes, the entire test fails.
it_it: Il risultato del test è determinato dalle asserzioni; se una qualsiasi asserzione nel test fallisce (in modo fatale o non fatale), o se il test fallisce, l'intero test fallisce.

source: The testing framework should liberate test writers from housekeeping chores and let them focus on the test content.
it_it: Il framework di testing dovrebbe liberare gli autori dalle "faccende domestiche" e consentire loro di concentrarsi sul contenuto del test.

source: The testing framework should liberate test writers from housekeeping chores and let them focus on the test *content*.
it_it: Il framework di testing dovrebbe liberare gli autori dalle "faccende domestiche" e consentire loro di concentrarsi sul *contenuto* del test.

source: The testing services needs to see the return value of RUN_ALL_TESTS() in order to determine if a test has passed.
it_it: I servizi di test devono vedere il valore restituito di RUN_ALL_TESTS() per determinare se un test è stato superato.

source: The testing services needs to see the return value of `RUN_ALL_TESTS()` in order to determine if a test has passed.
it_it: I servizi di test devono vedere il valore restituito di `RUN_ALL_TESTS()` per determinare se un test è stato superato.

source: The tests from the instantiation above will have these names:
it_it: I test dell'istanziazione precedente avranno questi nomi:

source: The trace dump is clickable in Emacs - hit return on a line number and you'll be taken to that line in the source file!
it_it: Il trace dump è cliccabile in Emacs: premere return su un numero di riga e si passerà a quella riga nel file sorgente!

source: The trace dump is clickable in Emacs - hit `return` on a line number and you'll be taken to that line in the source file!
it_it: Il trace dump è cliccabile in Emacs: premere `return` su un numero di riga e si passerà a quella riga nel file sorgente!

source: The trick is to delegate the ShareBuzz() method to a mock method (let’s call it DoShareBuzz()) that does not take move-only parameters.
it_it: Il trucco sta nel delegare il metodo ShareBuzz() a un metodo mock (chiamiamolo DoShareBuzz()) che non accetta parametri move-only.

source: The trick is to delegate the `ShareBuzz()` method to a mock method (let’s call it `DoShareBuzz()`) that does not take move-only parameters.
it_it: Il trucco sta nel delegare il metodo `ShareBuzz()` a un metodo mock (chiamiamolo `DoShareBuzz()`) che non accetta parametri move-only.

source: The trick is to redispatch the method in the mock class:
it_it: Il trucco sta nel redistribuire il metodo nella classe mock:

source: The tuple of the k selected (using 0-based indices) arguments matches m, e.g. Args<1, 2>(Eq()).
it_it: La tupla degli argomenti k selezionati (utilizzando indici a base 0) corrisponde a m, ad es. Args<1, 2>(Eq()).

source: The tuple of the `k` selected (using 0-based indices) arguments matches `m`, e.g. `Args<1, 2>(Eq())`.
it_it: La tupla degli argomenti `k` selezionati (utilizzando indici a base 0) corrisponde a `m`, ad es. `Args<1, 2>(Eq())`.

source: The two forms are equivalent, but .With(AllArgs(Lt())) is more readable than .With(Lt()).
it_it: Le due forme sono equivalenti, ma .With(AllArgs(Lt())) è più leggibile di .With(Lt()).

source: The two forms are equivalent, but `.With(AllArgs(Lt()))` is more readable than `.With(Lt())`.
it_it: Le due forme sono equivalenti, ma `.With(AllArgs(Lt()))` è più leggibile di `.With(Lt())`.

source: The type T is the type of the parameter.
it_it: Il tipo T è il tipo del parametro.

source: The type `T` is the type of the parameter.
it_it: Il tipo `T` è il tipo del parametro.

source: The type alias (using or typedef) is necessary for the INSTANTIATE_TYPED_TEST_SUITE_P macro to parse correctly.
it_it: L'alias del tipo (using o typedef) è necessario affinché la macro INSTANTIATE_TYPED_TEST_SUITE_P lo possa analizzare correttamente.

source: The type alias (using or typedef) is necessary for the TYPED_TEST_SUITE macro to parse correctly.
it_it: L'alias del tipo (using o typedef) è necessario affinché la macro TYPED_TEST_SUITE lo possa analizzare correttamente.

source: The type alias (`using` or `typedef`) is necessary for the `INSTANTIATE_TYPED_TEST_SUITE_P` macro to parse correctly.
it_it: L'alias del tipo (`using` o `typedef`) è necessario affinché la macro `INSTANTIATE_TYPED_TEST_SUITE_P` lo possa analizzare correttamente.

source: The type alias (`using` or `typedef`) is necessary for the `TYPED_TEST_SUITE` macro to parse correctly.
it_it: L'alias del tipo (`using` o `typedef`) è necessario affinché la macro `TYPED_TEST_SUITE` lo possa analizzare correttamente.

source: The type depends on the macro used to define the action and the parameter types.
it_it: Il tipo dipende dalla macro utilizzata per definire l'azione e i tipi dei parametri.

source: The type of callback must be a base callback type instead of a derived one, e.g.
it_it: Il tipo di callback deve essere un tipo di callback di base anziché derivato, ad es.

source: The type of `callback` must be a base callback type instead of a derived one, e.g.
it_it: Il tipo di `callback` deve essere un tipo di callback di base anziché derivato, ad es.

source: The type of all arguments of the mock function as a tuple
it_it: Il tipo di tutti gli argomenti della funzione mock come tupla

source: The type of the K-th (0-based) argument of the mock function
it_it: Il tipo dell'argomento K-esimo (in base 0) della funzione mock

source: The type of the mock function
it_it: Il tipo della funzione mock

source: The types T1, T2, ..., Tn can be either value types or reference types; if an argument has type T, it can be declared as either T or const T&, whichever is appropriate.
it_it: I tipi T1, T2, ..., Tn possono essere tipi valore o tipi riferimento; se un argomento è di tipo T, può essere dichiarato come T o come const T&, a seconda di quale sia appropriato.

source: The types `T1`, `T2`, ..., `Tn` can be either value types or reference types; if an argument has type `T`, it can be declared as either `T` or `const T&`, whichever is appropriate.
it_it: I tipi `T1`, `T2`, ..., `Tn` possono essere tipi valore o tipi riferimento; se un argomento è di tipo `T`, può essere dichiarato come `T` o come `const T&`, a seconda di quale sia appropriato.

source: The types of the selected arguments do *not* have to match the signature of the inner action exactly.
it_it: I tipi degli argomenti selezionati *non* devono corrispondere esattamente alla firma dell'azione interna.

source: The types of the selected arguments do not have to match the signature of the inner action exactly.
it_it: I tipi degli argomenti selezionati non devono corrispondere esattamente alla firma dell'azione interna.

source: The typical usage, which basically simulates the behavior of a thrown exception, is:
it_it: L'utilizzo tipico, che sostanzialmente simula il comportamento della generazione di un'eccezione, è:

source: The typical work flow is:
it_it: Il flusso di lavoro tipico è:

source: The usage of StrictMock is similar, except that it makes all uninteresting calls failures:
it_it: L'utilizzo di StrictMock è simile, tranne per il fatto che trasforma tutte le chiamate "non interessanti" in errori:

source: The usage of `StrictMock` is similar, except that it makes all uninteresting calls failures:
it_it: L'utilizzo di `StrictMock` è simile, tranne per il fatto che trasforma tutte le chiamate "non interessanti" in errori:

source: The use of WillOnce implicitly sets a cardinality on the expectation when Times is not specified.
it_it: L'uso di WillOnce imposta implicitamente una cardinalità sulla expectation quando Times non è specificato.

source: The use of WillRepeatedly implicitly sets a cardinality on the expectation when Times is not specified.
it_it: L'uso di WillRepeatedly imposta implicitamente una cardinalità sulla expectation quando Times non è specificato.

source: The use of `WillOnce` implicitly sets a cardinality on the expectation when `Times` is not specified.
it_it: L'uso di `WillOnce` imposta implicitamente una cardinalità sulla expectation quando `Times` non è specificato.

source: The use of `WillRepeatedly` implicitly sets a cardinality on the expectation when `Times` is not specified.
it_it: L'uso di `WillRepeatedly` imposta implicitamente una cardinalità sulla expectation quando `Times` non è specificato.

source: The use of matchers makes EXPECT_THAT a powerful, extensible assertion.
it_it: L'uso dei matcher rende EXPECT_THAT un'asserzione potente ed estensibile.

source: The use of matchers makes `EXPECT_THAT` a powerful, extensible assertion.
it_it: L'uso dei matcher rende `EXPECT_THAT` un'asserzione potente ed estensibile.

source: The value argument types are inferred by the compiler.
it_it: I tipi degli argomenti valore vengono dedotti dal compilatore.

source: The value arguments must be comparable by the assertion's comparison operator, otherwise a compiler error will result.
it_it: Gli argomenti del valore devono essere confrontabili dall'operatore di confronto dell'asserzione, altrimenti si verificherà un errore del compilatore.

source: The value it returns is irrelevant.
it_it: Il valore restituito è irrilevante.

source: The value returned by statements will be used as the return value of the action.
it_it: Il valore restituito dalle istruzioni verrà utilizzato come valore di ritorno dell'azione.

source: The value returned by `statements` will be used as the return value of the action.
it_it: Il valore restituito dalle `istruzioni` verrà utilizzato come valore di ritorno dell'azione.

source: The values do not include end.
it_it: I valori non includono end.

source: The values do not include `end`.
it_it: I valori non includono `end`.

source: The web-safe format from RFC 4648 is supported.
it_it: È supportato il formato 'safe' per il Web RFC 4648.

source: The web-safe format from [RFC 4648](https://www.rfc-editor.org/rfc/rfc4648#section-5) is supported.
it_it: È supportato il formato 'safe' per il Web [RFC 4648](https://www.rfc-editor.org/rfc/rfc4648#section-5).

source: The workaround is to move the content of your constructor/destructor to a private void member function, or switch to EXPECT_*() if that works.
it_it: La soluzione alternativa è quella di spostare il contenuto del costruttore/distruttore in una funzione membro void privata o passare a EXPECT_*() se funziona.

source: The workaround is to move the content of your constructor/destructor to a private void member function, or switch to `EXPECT_*()` if that works.
it_it: La soluzione alternativa è quella di spostare il contenuto del costruttore/distruttore in una funzione membro void privata o passare a `EXPECT_*()` se funziona.

source: Then InvokeArgument() will make a copy of the argument, and pass a reference to the copy, instead of a reference to the original value, to the callable.
it_it: In questo caso InvokeArgument() creerà una copia dell'argomento e passerà un riferimento alla copia, invece di un riferimento al valore originale, al richiamabile.

source: Then `InvokeArgument()` will *make a copy* of the argument, and pass a *reference to the copy*, instead of a reference to the original value, to the callable.
it_it: In questo caso `InvokeArgument()` *creerà una copia* dell'argomento e passerà un *riferimento alla copia*, invece di un riferimento al valore originale, al richiamabile [callable].

source: Then everyone can reference them from their tests.
it_it: Dopodiché tutti possono farvi riferimento dai loro test.

source: Then in the test body they set the expectations, which are often different for each test.
it_it: Poi nel corpo del test si stabiliscono le expectation, che spesso sono diverse per ogni test.

source: Then pass proxy obtained from AsStdFunction() to the code you are testing.
it_it: Poi si passa il proxy ottenuto da AsStdFunction() al codice da testare.

source: Then pass proxy obtained from `AsStdFunction()` to the code you are testing.
it_it: Poi si passa il proxy ottenuto da `AsStdFunction()` al codice da testare.

source: Then the statement EXPECT_FALSE(IsEven(Fib(6))) will print
it_it: Quindi verrà stampata l'istruzione EXPECT_FALSE(IsEven(Fib(6)))

source: Then the statement `EXPECT_FALSE(IsEven(Fib(6)))` will print
it_it: Quindi verrà stampata l'istruzione `EXPECT_FALSE(IsEven(Fib(6)))`

source: Then the test code should look like:
it_it: Allora il codice del test dovrebbe essere simile a:

source: Then use that implementation class in the original class.
it_it: Poi si usa quella classe di implementazione nella classe originale.

source: Then you can mock IOOps without mocking FileOps.
it_it: Poi si può creare la mock di IOOps senza avere un mock di FileOps.

source: Then you can mock `IOOps` without mocking `FileOps`.
it_it: Poi si può creare la mock di `IOOps` senza avere un mock di `FileOps`.

source: Then you can type M-m to start a build (if you want to run the test as well, just make sure foo_test.run or runtests is in the build command you supply after typing M-m), or M-up/M-down to move back and forth between errors.
it_it: Poi si può digitare M-m per avviare una build (se si vuole eseguire anche il test, assicurarsi solo che foo_test.run o runtests sia nel comando di compilazione fornito dopo aver digitato M-m), o M-up/M-down per spostarsi avanti e indietro tra gli errori.

source: Then you can type `M-m` to start a build (if you want to run the test as well, just make sure `foo_test.run` or `runtests` is in the build command you supply after typing `M-m`), or `M-up`/`M-down` to move back and forth between errors.
it_it: Poi si può digitare `M-m` per avviare una build (se si vuole eseguire anche il test, assicurarsi solo che `foo_test.run` o `runtests` sia nel comando di compilazione fornito dopo aver digitato `M-m`, o `M-up`/`M-down` per spostarsi avanti e indietro tra gli errori.

source: Then you can use CreateConnection<ConcretePacketStream>() and PacketReader<ConcretePacketStream> in production code, and use CreateConnection<MockPacketStream>() and PacketReader<MockPacketStream> in tests.
it_it: Poi si possono usare CreateConnection<ConcretePacketStream>() e PacketReader<ConcretePacketStream> nel codice di produzione, e nei test CreateConnection<MockPacketStream>() e PacketReader<MockPacketStream>.

source: Then you can use `CreateConnection<ConcretePacketStream>()` and `PacketReader<ConcretePacketStream>` in production code, and use `CreateConnection<MockPacketStream>()` and `PacketReader<MockPacketStream>` in tests.
it_it: Poi si possono usare `CreateConnection<ConcretePacketStream>()` e `PacketReader<ConcretePacketStream>` nel codice di produzione, e nei test `CreateConnection<MockPacketStream>()` e `PacketReader<MockPacketStream>`.

source: Then you can verify that the mock function calls do happen at the right time.
it_it: Poi si può verificare che le chiamate alle funzioni mock avvengano al momento giusto.

source: Then you have to spend time fixing them, only to see them broken again the next time the implementation is changed.
it_it: Quindi si deve dedicare del tempo a risolverli, solo per vederli rotti nuovamente la prossima volta che l'implementazione viene modificata.

source: Then you implement that interface as an adaptor on top of Concrete.
it_it: Quindi si implementa l'interfaccia come un adattatore al di sopra di Concrete.

source: Then you implement that interface as an adaptor on top of `Concrete`.
it_it: Quindi si implementa l'interfaccia come un adattatore al di sopra di `Concrete`.

source: Then you would run the same foo_test on each machine.
it_it: Poi si esegue lo stesso foo_test su ciascuna macchina.

source: Then you would run the same `foo_test` on each machine.
it_it: Poi si esegue lo stesso `foo_test` su ciascuna macchina.

source: Then, EXPECT_THAT(x, DivisibleBy7()); may generate a message like this:
it_it: Poi, EXPECT_THAT(x, DivisibleBy7()); può generare un messaggio come questo:

source: Then, `EXPECT_THAT(x, DivisibleBy7());` may generate a message like this:
it_it: Poi, `EXPECT_THAT(x, DivisibleBy7());` può generare un messaggio come questo:

source: Then, instead of setting expectations on ShareBuzz(), you set them on the DoShareBuzz() mock method:
it_it: Poi, invece di impostare le expectation su ShareBuzz(), si impostano su l metodo mock DoShareBuzz():

source: Then, instead of setting expectations on `ShareBuzz()`, you set them on the `DoShareBuzz()` mock method:
it_it: Poi, invece di impostare le expectation su `ShareBuzz()`, si impostano su l metodo mock `DoShareBuzz()`:

source: Then, the author of each implementation can just instantiate the test suite with their type to verify that it conforms to the requirements, without having to write similar tests repeatedly.
it_it: Quindi, l'autore di ciascuna implementazione può semplicemente istanziare la test suite con il proprio tipo per verificare che sia conforme ai requisiti, senza dover scrivere ripetutamente test simili.

source: Then, the test runner can check if this file exists.
it_it: Poi, il test runner può verificare se questo file esiste.

source: Then, use TYPED_TEST() instead of TEST_F() to define a typed test for this test suite.
it_it: Poi, si usa TYPED_TEST() invece di TEST_F() per definire un test tipizzato per questa test suite.

source: Then, use TYPED_TEST_P() to define a type-parameterized test.
it_it: Poi, si usa TYPED_TEST_P() per definire un test con un tipo parametrizzato.

source: Then, use `TYPED_TEST()` instead of `TEST_F()` to define a typed test for this test suite.
it_it: Poi, si usa `TYPED_TEST()` invece di `TEST_F()` per definire un test tipizzato per questa test suite.

source: Then, use `TYPED_TEST_P()` to define a type-parameterized test.
it_it: Poi, si usa `TYPED_TEST_P()` per definire un test con un tipo parametrizzato.

source: Then, use the TEST_P macro to define as many test patterns using this fixture as you want.
it_it: Poi, si usa la macro TEST_P per definire tutti i pattern di test desiderati utilizzando questa fixture.

source: Then, use the `TEST_P` macro to define as many test patterns using this fixture as you want.
it_it: Poi, si usa la macro `TEST_P` per definire tutti i pattern di test desiderati utilizzando questa fixture.

source: Then, you register an instance of your environment class with GoogleTest by calling the ::testing::AddGlobalTestEnvironment() function:
it_it: Poi, si registra un'istanza della classe di ambiente con GoogleTest chiamando la funzione ::testing::AddGlobalTestEnvironment():

source: Then, you register an instance of your environment class with GoogleTest by calling the `::testing::AddGlobalTestEnvironment()` function:
it_it: Poi, si registra un'istanza della classe di ambiente con GoogleTest chiamando la funzione `::testing::AddGlobalTestEnvironment()`:

source: There are two cases to consider:
it_it: Ci sono due casi da considerare:

source: There are several tricks to do that.
it_it: Ci sono diversi trucchi per farlo.

source: There are a few things that you need to understand when using fixtures:
it_it: Ci sono alcune cose che devi capire quando si usano le fixture:

source: There are basically two constructs for defining the behavior of a mock object: ON_CALL and EXPECT_CALL.
it_it: Esistono fondamentalmente due costrutti per definire il comportamento di un oggetto mock: ON_CALL e EXPECT_CALL.

source: There are basically two constructs for defining the behavior of a mock object: `ON_CALL` and `EXPECT_CALL`.
it_it: Esistono fondamentalmente due costrutti per definire il comportamento di un oggetto mock: `ON_CALL` and `EXPECT_CALL`.

source: There are certain tests that fail at times and pass at most other times.
it_it: Ci sono alcuni test che a volte falliscono e passano nella maggior parte dei casi.

source: There are even assertions that enable you to verify more complex states by providing custom predicates.
it_it: Esistono anche asserzioni che consentono di verificare stati più complessi fornendo predicati personalizzati.

source: There are many built-in matchers for common types (as well as custom matchers); for example:
it_it: Esistono molti matcher nativi [built-in] per i tipi comuni (così come matcher personalizzati); per esempio:
